In [1]:
import kelas as k

In [2]:
df = k.data()

In [4]:
df.tabel()
df.baris()
df.cetak_tabel()

Masukkan banyaknya data yang ingin dimasukkan : 2
Masukkan nama mahasiswa 	: fajri
Masukkan nim mahasiswa 		: 123123
Masukkan nilai formatif 	: 90
Masukkan nilai uts 		: 90
Masukkan nilai uas 		: 90
Masukkan nama mahasiswa 	: chika
Masukkan nim mahasiswa 		: 123124
Masukkan nilai formatif 	: 90
Masukkan nilai uts 		: 95
Masukkan nilai uas 		: 90

      NIM   Nama Formatif UTS UAS  Nilai Akhir Huruf
0  123123  fajri       90  90  90         90.0     A
1  123124  chika       90  95  90         91.5     A

In [5]:
df1 = df.cetak_tabel()
df1

      NIM   Nama Formatif UTS UAS  Nilai Akhir Huruf
0  123123  fajri       90  90  90         90.0     A
1  123124  chika       90  95  90         91.5     A

In [6]:
df1.to_excel('tabel.xlsx', index=False)